; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=65, out_folder=htg/blocksworld/training, instance_id=45, seed=2069

(define (problem blocksworld-45)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 - object)
 (:init 
    (arm-empty)
    (clear b50)
    (on b50 b33)
    (on b33 b58)
    (on b58 b26)
    (on-table b26)
    (clear b54)
    (on b54 b1)
    (on b1 b64)
    (on b64 b7)
    (on b7 b60)
    (on b60 b23)
    (on b23 b20)
    (on b20 b65)
    (on b65 b21)
    (on b21 b52)
    (on b52 b31)
    (on b31 b40)
    (on-table b40)
    (clear b4)
    (on b4 b8)
    (on b8 b27)
    (on-table b27)
    (clear b57)
    (on b57 b30)
    (on b30 b12)
    (on b12 b29)
    (on b29 b46)
    (on b46 b56)
    (on b56 b39)
    (on b39 b10)
    (on b10 b62)
    (on b62 b42)
    (on b42 b24)
    (on b24 b25)
    (on b25 b44)
    (on-table b44)
    (clear b14)
    (on b14 b37)
    (on b37 b59)
    (on-table b59)
    (clear b43)
    (on b43 b41)
    (on b41 b2)
    (on b2 b13)
    (on b13 b51)
    (on b51 b9)
    (on b9 b32)
    (on b32 b48)
    (on b48 b28)
    (on b28 b53)
    (on b53 b3)
    (on b3 b5)
    (on b5 b17)
    (on b17 b11)
    (on b11 b45)
    (on b45 b36)
    (on b36 b16)
    (on b16 b63)
    (on b63 b22)
    (on b22 b15)
    (on b15 b38)
    (on b38 b6)
    (on-table b6)
    (clear b49)
    (on-table b49)
    (clear b18)
    (on-table b18)
    (clear b19)
    (on b19 b61)
    (on b61 b55)
    (on b55 b35)
    (on b35 b34)
    (on b34 b47)
    (on-table b47))
 (:goal  (and 
    (clear b5)
    (on b5 b1)
    (on b1 b2)
    (on b2 b3)
    (on b3 b6)
    (on b6 b4)
    (on-table b4))))

; plan
1. (unstack b4 b8)
   deleted: (on b4 b8) (clear b4) (arm-empty)
   added: (holding b4) (clear b8)
   goals met: 0 of 7
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 7
3. (unstack b43 b41)
   deleted: (on b43 b41) (clear b43) (arm-empty)
   added: (holding b43) (clear b41)
   goals met: 1 of 7
4. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 1 of 7
5. (unstack b41 b2)
   deleted: (on b41 b2) (clear b41) (arm-empty)
   added: (holding b41) (clear b2)
   goals met: 1 of 7
6. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 1 of 7
7. (unstack b54 b1)
   deleted: (on b54 b1) (clear b54) (arm-empty)
   added: (holding b54) (clear b1)
   goals met: 1 of 7
8. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 1 of 7
9. (unstack b2 b13)
   deleted: (on b2 b13) (clear b2) (arm-empty)
   added: (holding b2) (clear b13)
   goals met: 1 of 7
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 7
11. (unstack b1 b64)
   deleted: (on b1 b64) (clear b1) (arm-empty)
   added: (holding b1) (clear b64)
   goals met: 1 of 7
12. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 2 of 7
13. (unstack b13 b51)
   deleted: (on b13 b51) (clear b13) (arm-empty)
   added: (holding b13) (clear b51)
   goals met: 2 of 7
14. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 7
15. (unstack b51 b9)
   deleted: (on b51 b9) (clear b51) (arm-empty)
   added: (holding b51) (clear b9)
   goals met: 2 of 7
16. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 2 of 7
17. (unstack b9 b32)
   deleted: (on b9 b32) (clear b9) (arm-empty)
   added: (holding b9) (clear b32)
   goals met: 2 of 7
18. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 7
19. (unstack b32 b48)
   deleted: (on b32 b48) (clear b32) (arm-empty)
   added: (holding b32) (clear b48)
   goals met: 2 of 7
20. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 2 of 7
21. (unstack b48 b28)
   deleted: (on b48 b28) (clear b48) (arm-empty)
   added: (holding b48) (clear b28)
   goals met: 2 of 7
22. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 2 of 7
23. (unstack b28 b53)
   deleted: (on b28 b53) (clear b28) (arm-empty)
   added: (holding b28) (clear b53)
   goals met: 2 of 7
24. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 2 of 7
25. (unstack b53 b3)
   deleted: (on b53 b3) (clear b53) (arm-empty)
   added: (holding b53) (clear b3)
   goals met: 2 of 7
26. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 7
27. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 3 of 7
28. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 7
29. (unstack b5 b17)
   deleted: (on b5 b17) (clear b5) (arm-empty)
   added: (holding b5) (clear b17)
   goals met: 2 of 7
30. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 4 of 7
31. (unstack b17 b11)
   deleted: (on b17 b11) (clear b17) (arm-empty)
   added: (holding b17) (clear b11)
   goals met: 4 of 7
32. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 4 of 7
33. (unstack b11 b45)
   deleted: (on b11 b45) (clear b11) (arm-empty)
   added: (holding b11) (clear b45)
   goals met: 4 of 7
34. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 7
35. (unstack b45 b36)
   deleted: (on b45 b36) (clear b45) (arm-empty)
   added: (holding b45) (clear b36)
   goals met: 4 of 7
36. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 4 of 7
37. (unstack b36 b16)
   deleted: (on b36 b16) (clear b36) (arm-empty)
   added: (holding b36) (clear b16)
   goals met: 4 of 7
38. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 4 of 7
39. (unstack b16 b63)
   deleted: (on b16 b63) (clear b16) (arm-empty)
   added: (holding b16) (clear b63)
   goals met: 4 of 7
40. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 4 of 7
41. (unstack b63 b22)
   deleted: (on b63 b22) (clear b63) (arm-empty)
   added: (holding b63) (clear b22)
   goals met: 4 of 7
42. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 4 of 7
43. (unstack b22 b15)
   deleted: (on b22 b15) (clear b22) (arm-empty)
   added: (holding b22) (clear b15)
   goals met: 4 of 7
44. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 7
45. (unstack b15 b38)
   deleted: (on b15 b38) (clear b15) (arm-empty)
   added: (holding b15) (clear b38)
   goals met: 4 of 7
46. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 7
47. (unstack b38 b6)
   deleted: (on b38 b6) (clear b38) (arm-empty)
   added: (holding b38) (clear b6)
   goals met: 4 of 7
48. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 4 of 7
49. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 4 of 7
50. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 5 of 7
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 7
52. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 6 of 7
53. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 4 of 7
54. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 7
55. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 4 of 7
56. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 7
57. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 7
58. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 5 of 7
59. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
60. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 7
61. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
62. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 7
